<template>
    <BasePage :links="links" title="Политика конфиденциальности">
        <div class="container">
            <section class="privacy-policy-description">
                <p>
                    Настоящая Политика конфиденциальности и обработки
                    персональных данных (далее – Политика конфиденциальности)
                    регулирует порядок обработки и использования персональных и
                    иных данных, собранных Товариществом с ограниченной
                    <em>ответственностью</em>
                    <em>«https://Stroiopttorg.ru,</em> (далее –
                    <em>Товарищество</em>) с помощью интернет-ресурса
                    <em>https://Stroiopttorg.ru</em> (далее – <em>Сайт</em>),
                    мобильного приложения <em>https://Stroiopttorg.ru</em> и
                    связанных с ними услуг и инструментов на Сайте.
                </p>
                <p>
                    Во всех указанных случаях Товарищество обрабатывает
                    персональные данные пользователей исключительно в рамках
                    требований
                    <cite>
                        Закона РФ от 21 мая 2013 года № 94-V «О персональных
                        данных и их защите» (далее – Закон), а также
                        международных договоров, ратифицированных Российской
                        Федерации.
                    </cite>
                </p>
            </section>
            <section class="privacy-policy">
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        1. Термины и определения
                    </h2>
                    <p>
                        В настоящей Политике конфиденциальности используются
                        следующие термины:
                    </p>
                    <ol>
                        <li>
                            1.1.1. Сайт – интернет-ресурс, расположенный в сети
                            Интернет по адресу: https://Stroiopttorg.ru. Все
                            исключительные права на Сайт и его отдельные
                            элементы (включая программное обеспечение, дизайн)
                            принадлежат Товариществу в полном объеме.
                        </li>
                        <li>
                            1.1.2. Персональные данные — персональные данные
                            Пользователя, которые Пользователь предоставляет
                            самостоятельно при регистрации или в процессе
                            использования функционала Сайта.
                        </li>
                        <li>
                            1.1.3. «Пользователь Сайта (далее – Пользователь)» –
                            лицо, имеющее доступ к Сайту, посредством сети
                            Интернет и использующее Сайт интернет-магазина.
                        </li>
                        <li>
                            1.1.4. «Обработка персональных данных» – действие
                            или совокупность действий, совершаемых с
                            использованием средств автоматизации или без
                            использования таких средств, направленные на
                            накопление, хранение, изменение, дополнение,
                            использование, передачу (распространение,
                            предоставление, доступ), обезличивание,
                            блокирование, удаление, уничтожение персональных
                            данных.
                        </li>
                        <li>
                            1.1.5. «Конфиденциальность персональных данных» –
                            обязательное для соблюдения Товариществом, его
                            работниками или иным получившим доступ к
                            персональным данным лицом требование не допускать их
                            распространения без согласия субъекта персональных
                            данных или наличия иного законного основания.
                        </li>
                        <li>
                            1.1.6. «Cookies» — небольшие текстовые файлы,
                            которые хранят информацию непосредственно на
                            компьютере пользователя, его мобильном телефоне или
                            другом устройстве.
                        </li>
                        <li>
                            1.1.7. «IP-адрес» — уникальный сетевой адрес узла в
                            компьютерной сети, построенной по протоколу IP.
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">2. Общие положения</h2>
                    <ol>
                        <li>
                            2.1. Использование Пользователем Сайта означает
                            согласие с настоящей Политикой конфиденциальности и
                            условиями обработки персональных данных
                            Пользователя.
                        </li>
                        <li>
                            2.2. В случае несогласия с условиями Политики
                            конфиденциальности Пользователь должен прекратить
                            использование Сайта.
                        </li>
                        <li>
                            2.3. Настоящая Политика конфиденциальности
                            применяется только к Сайту интернет-магазина
                            «https://Stroiopttorg.ru.com». Товарищество не
                            контролирует и не несет ответственность за сайты
                            третьих лиц, на которые Пользователь может перейти
                            по ссылкам, доступным на Сайте.
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        3. Предмет политики конфиденциальности
                    </h2>
                    <ol>
                        <li>
                            3.1. Настоящая Политика конфиденциальности
                            устанавливает обязательства Товарищества по
                            неразглашению и обеспечению режима защиты
                            конфиденциальности персональных данных, которые
                            Пользователь предоставляет при регистрации на Сайте
                            или при оформлении заказа для приобретения товара.
                        </li>
                        <li>
                            3.2. Персональные данные, разрешённые к обработке в
                            рамках настоящей Политики конфиденциальности,
                            предоставляются Пользователем при оформлении Заказа
                            на Сайте или шоу-руме и включают в себя следующую
                            информацию:
                            <ol>
                                <li>
                                    3.2.1. фамилию, имя и отчество Пользователя;
                                </li>
                                <li>3.2.2. контактный телефон Пользователя;</li>
                                <li>3.2.3. адрес электронной почты;</li>
                                <li>3.2.4. адрес доставки Товара;</li>
                            </ol>
                        </li>
                        <li>
                            3.3. Сайт защищает данные, которые автоматически
                            передаются в процессе просмотра рекламных блоков и
                            при посещении страниц, на которых установлен
                            статистический скрипт системы (“пиксель”):
                        </li>
                        <ul>
                            <li>IP адрес;</li>
                            <li>информация из cookies;</li>
                            <li>информация о браузере;</li>
                            <li>время доступа;</li>
                            <li>
                                адрес страницы, на котором расположен рекламный
                                блок;
                            </li>
                        </ul>

                        <li>
                            3.4. Сайт осуществляет сбор статистики об IP-адресах
                            своих посетителей. Данная информация используется с
                            целью выявления и решения технических проблем, для
                            контроля законности проводимых финансовых платежей.
                        </li>
                        <li>
                            3.5. Любая иная персональная информация не
                            оговоренная выше (история покупок, используемые
                            браузеры и операционные системы и т.д.) подлежит
                            надежному хранению и нераспространению, за
                            исключением случаев, предусмотренных в пунктах 5.2.
                            и 5.3. Политики конфиденциальности.
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        4. Цели сбора персональной информации пользователя
                    </h2>
                    <ol>
                        <li>
                            4.1. Персональные данные Пользователя Товарищество
                            может использовать в целях:
                            <ol>
                                <li>
                                    4.1.1. Идентификации Пользователя,
                                    зарегистрированного на Сайте, для оформления
                                    заказа и (или) заключения Договора
                                    купли-продажи товара дистанционным способом
                                    на Сайте.
                                </li>
                                <li>
                                    4.1.2. Предоставления Пользователю доступа к
                                    персонализированным ресурсам Сайта.
                                </li>
                                <li>
                                    4.1.3. Установления с Пользователем обратной
                                    связи, включая направление уведомлений,
                                    запросов, информационных сообщений,
                                    касающихся использования Сайта, оказания
                                    услуг, обработки запросов и заявок от
                                    Пользователя.
                                </li>
                                <li>
                                    4.1.4. Подтверждения достоверности и полноты
                                    персональных данных, предоставленных
                                    Пользователем.
                                </li>
                                <li>
                                    4.1.5. Статистических и маркетинговых
                                    исследований, с целью в том числе улучшения
                                    качества предоставления услуг.
                                </li>
                                <li>
                                    4.1.6. Создания учетной записи для
                                    совершения покупок, если Пользователь дал
                                    согласие на создание учетной записи.
                                </li>
                                <li>
                                    4.1.6. Создания учетной записи для
                                    совершения покупок, если Пользователь дал
                                    согласие на создание учетной записи.
                                </li>
                                <li>
                                    4.1.7. Уведомления Пользователя Сайта о
                                    состоянии его заказа, доставки заказа.
                                </li>

                                <li>
                                    4.1.8. Обработки и получения платежей,
                                    определения права на получение скидок,
                                    бонусов Пользователем.
                                </li>

                                <li>
                                    4.1.9. Предоставления Пользователю
                                    эффективной клиентской и технической
                                    поддержки при возникновении проблем,
                                    связанных с использованием Сайта.
                                </li>

                                <li>
                                    4.1.10. Предоставления Пользователю с его
                                    согласия, обновлений продукции, специальных
                                    предложений, информации о ценах, новостной
                                    рассылки и иных сведений от имени Сайта или
                                    от имени партнеров Сайта.
                                </li>

                                <li>
                                    4.1.11. Осуществления рекламной деятельности
                                    с согласия Пользователя.
                                </li>
                                <li>
                                    4.1.12. Предоставления доступа Пользователю
                                    на сайты или сервисы партнеров Сайта с целью
                                    получения продуктов, обновлений и услуг.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        5. Способы и сроки обработки персональной информации
                    </h2>
                    <ol>
                        <li>
                            5.1. Обработка персональных данных Пользователя
                            осуществляется без ограничения срока, но не дольше,
                            чем это предусмотрено законодательством Республики
                            Казахстан, любым законным способом, в том числе в
                            информационных системах персональных данных с
                            использованием средств автоматизации или без
                            использования таких средств.
                        </li>
                        <li>
                            5.2. Пользователь соглашается с тем, что
                            Товарищество вправе передавать персональные данные
                            третьим лицам, в частности, курьерским службам,
                            организациям почтовой связи, операторам связи,
                            исключительно в целях выполнения заказа
                            Пользователя, оформленного на Сайте, включая
                            доставку Товара.
                        </li>
                        <li>
                            5.3. Персональные данные Пользователя могут быть
                            переданы по запросу уполномоченных государственных
                            органов Республики Казахстан оформленных в
                            соответствии с требованиями законодательства
                            Республики Казахстан и только по основаниям и в
                            порядке, установленным законодательством РФ.
                        </li>
                        <li>
                            5.4. При утрате или разглашении персональных данных,
                            Товарищество информирует Пользователя об утрате или
                            разглашении персональных данных.
                        </li>
                        <li>
                            5.5. Товарищество принимает необходимые
                            организационные и технические меры для защиты
                            персональной информации Пользователя от
                            неправомерного или случайного доступа,
                            использования, уничтожения, изменения, блокирования,
                            копирования, распространения, а также от иных
                            неправомерных действий третьих лиц.
                        </li>
                        <li>
                            5.6. Товарищество принимает все необходимые меры, в
                            том числе правовые, организационные и технические,
                            для предотвращения убытков или иных отрицательных
                            последствий, вызванных утратой или разглашением
                            персональных данных Пользователя.
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        6. Права и обязанности сторон
                    </h2>
                    <ol>
                        <li>
                            6.1. Пользователь обязан:
                            <ol>
                                <li>
                                    6.1.1. Предоставить информацию о
                                    персональных данных, необходимую для
                                    пользования Сайтом.
                                </li>
                                <li>
                                    6.1.2. Обновить, дополнить предоставленную
                                    информацию о персональных данных в случае
                                    изменения данной информации.
                                </li>
                            </ol>
                        </li>
                        <li>
                            6.2. Пользователь вправе:
                            <ol>
                                <li>
                                    6.2.1. Знать о наличии у Товарищества своих
                                    персональных данных, а также получать
                                    информацию, содержащую подтверждение факта,
                                    цели, источников, способов сбора и обработки
                                    персональных данных, перечень персональных
                                    данных, сроки обработки персональных данных,
                                    в том числе сроки их хранения.
                                </li>
                                <li>
                                    6.2.2. Требовать от Товарищества, а также
                                    третьего лица изменения и дополнения своих
                                    персональных данных при наличии оснований,
                                    подтвержденных соответствующими документами.
                                </li>
                                <li>
                                    6.2.3. Требовать от Товарищества, а также
                                    третьего лица уничтожения своих персональных
                                    данных, сбор и обработка которых произведены
                                    с нарушением законодательства Республики
                                    Казахстан, а также в иных случаях,
                                    установленных нормативными правовыми актами
                                    Республики Казахстан.
                                </li>
                                <li>
                                    6.2.4. Защищать свои права и законные
                                    интересы, в порядке, установленном
                                    законодательством РФ.
                                </li>
                            </ol>
                        </li>
                        <li>
                            6.3. Товарищество обязано:
                            <ol>
                                <li>
                                    6.3.1. Использовать полученную информацию
                                    исключительно для целей, указанных в разделе
                                    4 настоящей Политики конфиденциальности.
                                </li>
                                <li>
                                    6.3.2. Обеспечить хранение конфиденциальной
                                    информации в тайне, не разглашать без
                                    предварительного письменного разрешения
                                    Пользователя, а также не осуществлять
                                    продажу, обмен, опубликование, либо
                                    разглашение иными возможными способами
                                    переданных персональных данных Пользователя,
                                    за исключением пунктов 5.2. и 5.3. настоящей
                                    Политики Конфиденциальности.
                                </li>
                                <li>
                                    6.3.3. Принимать и соблюдать необходимые
                                    меры, в том числе правовые, организационные
                                    и технические, для защиты персональных
                                    данных в соответствии с законодательством
                                    Республики Казахстан.
                                </li>
                                <li>
                                    6.3.4. Осуществлять блокирование
                                    персональных данных, относящихся к
                                    соответствующему Пользователю, с момента
                                    получения обращения или запроса
                                    Пользователя, или его законного
                                    представителя либо уполномоченного органа по
                                    защите прав субъектов персональных данных на
                                    период проверки, а также в случае выявления
                                    недостоверных персональных данных или
                                    неправомерных действий третьих лиц.
                                </li>
                                <li>
                                    6.3.5. Предоставлять по запросу
                                    уполномоченного органа в рамках рассмотрения
                                    обращений физических и юридических лиц
                                    информацию о способах и процедурах,
                                    используемых для обеспечения соблюдения
                                    Товариществом требований Закона.
                                </li>
                                <li>
                                    6.3.6. Принимать меры по уничтожению
                                    персональных данных в случае достижения цели
                                    их сбора и обработки, а также в иных
                                    случаях, установленных Законом.
                                </li>
                                <li>
                                    6.3.7. Соблюдать законодательство Республики
                                    Казахстан о персональных данных и их защите.
                                </li>
                                <li>
                                    6.3.8. Блокировать персональные данные,
                                    относящиеся к Пользователю, в случае наличия
                                    информации о нарушении условий их сбора,
                                    обработки.
                                </li>
                                <li>
                                    6.3.9. Уничтожить персональные данные в
                                    случае подтверждения факта их сбора,
                                    обработки с нарушением законодательства
                                    Республики Казахстан, а также в иных
                                    случаях, установленных Законом.
                                </li>
                            </ol>
                        </li>
                        <li>
                            6.4. Товарищество вправе:
                            <ol>
                                <li>
                                    6.4.1. Передавать персональные данные,
                                    относящиеся к Пользователю, третьим лицам,
                                    включая трансграничную передачу персональных
                                    данных (с условиями принятия такими третьими
                                    лицами обязательств по обеспечению
                                    конфиденциальности и защиты полученных
                                    персональных данных), с соблюдением
                                    требований законодательства Республики
                                    Казахстан о персональных данных и их защите.
                                    При этом трансграничная передача
                                    персональных данных возможна только на
                                    территорию иностранных государств,
                                    обеспечивающих защиту персональных данных,
                                    если иное прямо не предусмотрено Законом.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        7. Ответственность сторон
                    </h2>
                    <ol>
                        <li>
                            7.1. Товарищество, не исполнившее свои
                            обязательства, несёт ответственность за убытки,
                            понесённые Пользователем в связи с неправомерным
                            использованием персональных данных, в соответствии с
                            законодательством Республики Казахстан, за
                            исключением случаев, предусмотренных пунктами 5.2.,
                            5.3. и 7.2. Политики конфиденциальности.
                        </li>
                        <li>
                            7.2. В случае утраты или разглашения
                            конфиденциальной информации, Товарищество не несёт
                            ответственность, если данная конфиденциальная
                            информация:
                            <ol>
                                <li>
                                    7.2.1. Стала общедоступной, после ее
                                    предоставления Товариществу или его
                                    работникам, не по вине, действию или
                                    бездействию Товарищества.
                                </li>
                                <li>
                                    7.2.2. Была получена от третьей стороны до
                                    момента её получения Товариществом;
                                </li>
                                <li>
                                    7.2.3. Была разглашена с согласия
                                    Пользователя.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">8. Разрешение споров</h2>
                    <ol>
                        <li>
                            8.1. До обращения в суд с иском по спорам,
                            возникающим из отношений между Пользователем Сайта и
                            Товариществом, обязательным является предъявление
                            претензии (письменного предложения о добровольном
                            урегулировании спора). Все претензии в адрес
                            Товарищества должны быть направлены заказным письмом
                            по юридическому адресу Товарищества, дополнительно
                            претензия может быть направлена на электронный адрес
                            info@https://Stroiopttorg.ru.
                        </li>
                        <li>
                            8.2. Получатель претензии в течение 30 календарных
                            дней со дня получения претензии, письменно
                            уведомляет заявителя претензии о результатах
                            рассмотрения претензии.
                        </li>
                        <li>
                            8.3. При недостижении соглашения спор будет передан
                            на рассмотрение в судебный орган в соответствии с
                            действующим законодательством Республики Казахстан.
                        </li>
                    </ol>
                </article>
                <article class="privacy-policy__paragraph">
                    <h2 class="privacy-policy__title">
                        9. Заключительные положения
                    </h2>
                    <ol>
                        <li>
                            9.1. К настоящей Политике конфиденциальности и
                            отношениям между Пользователем и Товариществом
                            применяется действующее законодательство Республики
                            Казахстан.
                        </li>
                        <li>
                            9.2. Действующая Политика конфиденциальности
                            размещена на в подвале сайта
                            https://Stroiopttorg.ru.
                        </li>
                        <li>
                            9.3. Товарищество вправе вносить изменения в
                            настоящую Политику конфиденциальности без согласия
                            Пользователя. Новая редакция Политики
                            конфиденциальности вступает в силу с момента ее
                            размещения в сети Интернет по указанному в пункте
                            9.2. адресу.
                        </li>
                        <li>
                            9.4. Все предложения или вопросы по настоящей
                            Политике конфиденциальности следует отправлять на
                            адрес электронной почты: info@Stroiopttorg.ru.
                        </li>
                    </ol>
                </article>
            </section>
        </div>
    </BasePage>
</template>

<script setup lang="ts">
import type { Link } from '@/shared/types/types';
import { BasePage } from '@/widgets';

const links: Link[] = [
    { title: 'Стройоптторг', link: '/' },
    { title: 'Политика конфиденциальности', link: '/privacy-policy' },
];
</script>

<style lang="scss" scoped>
@use '@/assets/scss/display' as *;

.privacy-policy-description {
    @extend .column;
    gap: 10px;

    margin-bottom: 30px;
    padding: 20px 25px 20px 25px;
    border-radius: 8px;

    background-color: #f8f8f8;

    * {
        font-size: 15px;
        font-weight: 400;
        line-height: 27px;
        letter-spacing: 0%;
    }

    em {
        font-weight: bold;
        font-style: normal;
    }

    cite {
        font-style: normal;
    }
}

.privacy-policy {
    * {
        font-size: 15px;
        font-weight: 400;
        line-height: 27px;
    }

    &__title {
        margin-top: 10px;
        margin-bottom: 10px;
        font-weight: bolder;
        text-transform: uppercase;
    }

    li {
        margin-bottom: 10px;
    }
}
</style>
