<template>
    <div class="delivery-and-buy-tab">
        <h2 class="title">Доставка</h2>
        <p>
            Мы всегда готовы доставить приобретенный Вами товар в удобное для
            Вас время. <strong>Стоимость доставки</strong> товаров определяется
            исходя из <strong>веса</strong>, <strong>габаритов</strong> и
            <strong>удаленности</strong> до места назначения. Доставка
            осуществляется до подъезда дома, офиса. Наш интернет-магазин
            предлагает несколько вариантов получения товара:
        </p>
        <ul>
            <li>Самовывоз с территории компании.</li>
            <li>Быстрая доставка по Карачаево- Черкесской республике.</li>
            <li>Доставка транспортной компанией.</li>
            <li>Почтой России.</li>
        </ul>
        <h2 class="title">Оплата</h2>
        <p>Оплатить свои покупки вы можете:</p>
        <p><strong>- При заказе доставки:</strong></p>
        <ol>
            <li>
                <strong
                    >1. Банковской картой с помощью платежной системы на
                    сайте</strong
                >
                <ul>
                    <li>МИР</li>
                    <li>VISA International</li>
                    <li>Mastercard Worldwide</li>
                    <li>JCB</li>
                </ul>
            </li>
            <li>
                <strong>2. Наличными водителю при получении заказа</strong>
                <ol>
                    <li>
                        <strong>При самовывозе:</strong>
                        <ul>
                            <li>
                                Банковской картой с помощью платежной системы на
                                сайте или на кассе при получении заказа.
                            </li>
                            <li>Наличными на кассе при получении заказа</li>
                        </ul>
                    </li>
                    <li>
                        <strong>Сервис "Покупай со сбером"</strong>
                    </li>
                </ol>
            </li>
        </ol>
    </div>
</template>
